_Rarzrabotki/Kazna/InformationRegisters/ИдентификацияВизирующихПоРолям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИдентификацияВизирующихПоРолям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Переадресация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переадресант</Name>
					<Comment>ИО пользователя на данной роли</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыАдресацийРолейВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыАдресацийРолейВизирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПодразделению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНаправлению</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОРганизация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Бригады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бригада</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Направления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Направления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ИдентификацияВизирующихПоРолям/Ext/ManagerModule.bsl
Функция ПолучитьМассивПользователей( пПараметры ) Экспорт 
	
	лРоль			= Неопределено;
	лДата			= Неопределено;
	лПодразделение	= Неопределено;
	лОрганизация    = Неопределено;
	лВидОплаты      = Неопределено;
	лСтатьяДДС		= Неопределено; 
	лНаправление		= Неопределено; 
	
	
	пПараметры.Свойство("Подразделение", 	лПодразделение);
	пПараметры.Свойство("Организация", 		лОрганизация);
	пПараметры.Свойство("ВидОплаты", 		лВидОплаты);
	пПараметры.Свойство("Роль", 			лРоль);
	пПараметры.Свойство("Дата", 			лДата);
	пПараметры.Свойство("Направление", 		лНаправление);
	                                                           
	Если НЕ пПараметры.Свойство("СтатьяДДС", лСтатьяДДС) Тогда 
		пПараметры.Свойство("СтатьяДвиженияДенежныхСредств", лСтатьяДДС);
	КонецЕсли;
	                                                     
	лПодразделение = ?(Не ЗначениеЗаполнено(лПодразделение), Справочники.Подразделения.ПустаяСсылка(), лПодразделение);
	лПодразделения = Новый Массив();
	лПодразделения.Добавить(Неопределено);
	лПодразделения.Добавить(Справочники.Подразделения.ПустаяСсылка());
	Пока ЗначениеЗаполнено(лПодразделение) Цикл 
		лПодразделения.Добавить(лПодразделение);
		лПодразделение = лПодразделение.Родитель;
	КонецЦикла;
	
	лНаправления = Новый Массив();
	Если ЗначениеЗаполнено(лНаправление) Тогда
		лНаправления.Добавить(лНаправление);
	Иначе	
		лНаправления.Добавить(Справочники.Направления.ПустаяСсылка());
	КонецЕсли;

	
	лОрганизации  = Новый Массив();
	лОрганизации.Добавить(лОрганизация);
	лОрганизации.Добавить(Справочники.Организации.ПустаяСсылка());
	лОрганизации.Добавить(Неопределено);
	
	лДата 			=?(лДата = Неопределено, ТекущаяДата(), лДата);
	
	лЗапрос 		= Новый Запрос();
	
	лЗапрос.Текст 	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	              	  |	Т.Пользователь КАК Пользователь1,
	              	  |	ВЫБОР
	              	  |		КОГДА Т.Переадресация = ИСТИНА
	              	  |				И (Т.ПереадресацияДо >= &Дата
	              	  |					ИЛИ Т.ПереадресацияДо = &Дата0)
	              	  |				И (Т.ПереадресацияС <= &Дата
	              	  |					ИЛИ Т.ПереадресацияС = &Дата0)
	              	  |			ТОГДА Т.Переадресант
	              	  |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	              	  |	КОНЕЦ КАК Пользователь2
	              	  |ПОМЕСТИТЬ Т_Данные
	              	  |ИЗ
	              	  |	РегистрСведений.ИдентификацияВизирующихПоРолям КАК Т
	              	  |ГДЕ
	              	  |	Т.Роль = &Роль
	              	  |	И (Т.Роль.ВидАдресации = ЗНАЧЕНИЕ(Перечисление.ВидыАдресацийРолейВизирования.ПоОрганизации)
	              	  |				И Т.Объект В (&Организации)
	              	  |			ИЛИ Т.Роль.ВидАдресации = ЗНАЧЕНИЕ(Перечисление.ВидыАдресацийРолейВизирования.ПоПодразделению)
	              	  |				И Т.Объект В (&Подразделения)
	              	  |			ИЛИ Т.Роль.ВидАдресации = ЗНАЧЕНИЕ(Перечисление.ВидыАдресацийРолейВизирования.ПоНаправлению)
	              	  |				И Т.Объект В (&Направления))
	              	  |;
	              	  |
	              	  |////////////////////////////////////////////////////////////////////////////////
	              	  |ВЫБРАТЬ РАЗЛИЧНЫЕ
	              	  |	Т.Пользователь1 КАК Пользователь
	              	  |ИЗ
	              	  |	(ВЫБРАТЬ
	              	  |		Т_Данные.Пользователь1 КАК Пользователь1
	              	  |	ИЗ
	              	  |		Т_Данные КАК Т_Данные
	              	  |	
	              	  |	ОБЪЕДИНИТЬ ВСЕ
	              	  |	
	              	  |	ВЫБРАТЬ
	              	  |		Т_Данные.Пользователь2
	              	  |	ИЗ
	              	  |		Т_Данные КАК Т_Данные) КАК Т
	              	  |ГДЕ
	              	  |	Т.Пользователь1 <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
					  
 	лЗапрос.УстановитьПараметр("Подразделения", лПодразделения);
	лЗапрос.УстановитьПараметр("Организации", 	лОрганизации);
	лЗапрос.УстановитьПараметр("Направления", 	лНаправления);
	лЗапрос.УстановитьПараметр("Роль",			лРоль);
	лЗапрос.УстановитьПараметр("Дата",			лДата);
	лЗапрос.УстановитьПараметр("Дата0", 		Дата("00010101"));

	лТЗ 	= лЗапрос.Выполнить().Выгрузить();
	Возврат лТЗ.ВыгрузитьКолонку("Пользователь");

КонецФункции
